; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	thermograph1 - mode
	image0 - mode
	Star2 - direction
	Star0 - direction
	GroundStation1 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 image0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star3)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star5)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon13)
)
(:goal (and
	(pointing satellite2 Phenomenon6)
	(have_image Phenomenon6 thermograph1)
	(have_image Star7 thermograph1)
	(have_image Star8 thermograph1)
	(have_image Star9 thermograph1)
	(have_image Phenomenon10 thermograph1)
	(have_image Star11 image0)
	(have_image Planet12 image0)
	(have_image Phenomenon13 image0)
	(have_image Star14 image0)
	(have_image Phenomenon15 thermograph1)
	(have_image Phenomenon16 thermograph1)
))

)

; plan
1. (turn_to satellite2 star3 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 star3)
   goals met: 0 of 12
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 12
3. (calibrate satellite2 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 0 of 12
4. (turn_to satellite2 phenomenon16 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon16)
   goals met: 0 of 12
5. (take_image satellite2 phenomenon16 instrument3 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 1 of 12
6. (turn_to satellite2 phenomenon15 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon15)
   goals met: 1 of 12
7. (take_image satellite2 phenomenon15 instrument3 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 2 of 12
8. (turn_to satellite2 phenomenon13 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon13)
   goals met: 2 of 12
9. (take_image satellite2 phenomenon13 instrument3 image0)
   added: (have_image phenomenon13 image0)
   goals met: 3 of 12
10. (turn_to satellite2 phenomenon10 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon10)
   goals met: 3 of 12
11. (take_image satellite2 phenomenon10 instrument3 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 4 of 12
12. (turn_to satellite2 planet12 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet12)
   goals met: 4 of 12
13. (take_image satellite2 planet12 instrument3 image0)
   added: (have_image planet12 image0)
   goals met: 5 of 12
14. (turn_to satellite2 star11 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 star11)
   goals met: 5 of 12
15. (take_image satellite2 star11 instrument3 image0)
   added: (have_image star11 image0)
   goals met: 6 of 12
16. (turn_to satellite2 star14 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star14)
   goals met: 6 of 12
17. (take_image satellite2 star14 instrument3 image0)
   added: (have_image star14 image0)
   goals met: 7 of 12
18. (turn_to satellite2 star7 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star7)
   goals met: 7 of 12
19. (take_image satellite2 star7 instrument3 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 8 of 12
20. (turn_to satellite2 star8 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star8)
   goals met: 8 of 12
21. (take_image satellite2 star8 instrument3 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 9 of 12
22. (turn_to satellite2 star9 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star9)
   goals met: 9 of 12
23. (take_image satellite2 star9 instrument3 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 10 of 12
24. (turn_to satellite2 phenomenon6 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 phenomenon6)
   goals met: 11 of 12
25. (take_image satellite2 phenomenon6 instrument3 thermograph1)
   added: (have_image phenomenon6 thermograph1)
   goals met: 12 of 12
